# libraries & global vars

In [1]:
import pandas as pd
import numpy as np
pd.set_option('display.max_rows', None)

# io job_str

In [2]:
path_job_str = "C:/Users/seoul/Dropbox/00 technical/github/nkelites/data/combined data/combined data - 1 cleaning/cleaning step 4 - career/4.3.1 jobs/"

In [6]:
filein_job_str = "job_str_2_substr_multi2.xlsx"

In [7]:
fileout_job_str = "job_str_2_substr_multi2_expanded.xlsx"

In [24]:
job_str = pd.read_excel(path_job_str+filein_job_str,dtype="str")

In [25]:
job_str.shape

(457, 9)

In [26]:
job_str[0:2]

,CareerStringID,MultipleSubstrings,NotJob,CareerString,CareerDateString_2022,CareerStartYear,CareerStartMonth,OrgString,PositionString
0,111,2,NaN,"1948. 7 인민군 대좌, 제10사단 25연대장",NaN,1948,7,인민군,대좌
1,136,2,NaN,1950.12 민족보위성 부상 겸 문화부 부장,NaN,1950,12,민족보위성,부상

In [27]:
# job_str.drop(columns=["CareerSubstringID"],inplace=True)

# expand rows and recode CareerStringID

In [28]:
t = job_str.copy()
t.shape

(457, 9)

In [29]:
count = 0
for index,row in t.iterrows():
    count+=int(row["MultipleSubstrings"])
print(count)

1078

In [30]:
t[t.MultipleSubstrings.isnull()]

Empty DataFrame
Columns: [CareerStringID, MultipleSubstrings, NotJob, CareerString, CareerDateString_2022, CareerStartYear, CareerStartMonth, OrgString, PositionString]
Index: []

In [31]:
count = 0
for index,row in t.iterrows():
    
    #count+=1
    #print(index,int(row["MultipleSubstrings"]))
    row["OrgString"] = np.nan
    row["PositionString"] = np.nan

    for cind in range(2,int(row["MultipleSubstrings"])+1):
        count+=1
        nrow = row.copy()
        nrow["CareerStringID"] = float(nrow["CareerStringID"]+"."+str(cind))
        t = t.append(nrow,ignore_index=True)
        # print(count,t.shape)
        
    t.loc[index,["CareerStringID"]] = float(row["CareerStringID"]+".1")
    t.loc[index,["OrgString"]] = np.nan
    t.loc[index,["PositionString"]] = np.nan

In [32]:
t.shape

(1078, 9)

In [33]:
t.sort_values("CareerStringID",inplace=True,ignore_index=True)

In [35]:
t[~t.NotJob.isna()]

,CareerStringID,MultipleSubstrings,NotJob,CareerString,CareerDateString_2022,CareerStartYear,CareerStartMonth,OrgString,PositionString
190,2028.1,2,1,2000. 4 인민보안상 2003. 7 인민보안상 해임 *후임 : 최용수,NaN,2000,4,NaN,NaN
191,2028.2,2,1,2000. 4 인민보안상 2003. 7 인민보안상 해임 *후임 : 최용수,NaN,2000,4,NaN,NaN
231,3067.1,1,1,2010. 6 내각 총리 해임 *후임 : 최영림,NaN,2010,6,NaN,NaN
236,3107.1,1,1,2010. 9 강원도 인민위원회 위원장 해임 *후임 : 원도희,NaN,2010,9,NaN,NaN
440,4133.1,1,1,군 총정치국장 해임 * 후임: 황병서,2014.04,2014,4,NaN,NaN
457,4251.1,3,1,"김일성군사종합대학, 만경대혁명학원, 소련 푸룬제아카데미 졸업",연도미상,NaN,NaN,NaN,NaN
458,4251.2,3,1,"김일성군사종합대학, 만경대혁명학원, 소련 푸룬제아카데미 졸업",연도미상,NaN,NaN,NaN,NaN
459,4251.3,3,1,"김일성군사종합대학, 만경대혁명학원, 소련 푸룬제아카데미 졸업",연도미상,NaN,NaN,NaN,NaN
460,4252.1,2,1,"김일성군사종합대학, 소련 프룬제군사대학 졸업",연도미상,NaN,NaN,NaN,NaN
461,4252.2,2,1,"김일성군사종합대학, 소련 프룬제군사대학 졸업",연도미상,NaN,NaN,NaN,NaN
462,4257.1,2,1,"김일성사범대학 졸업, 불교학원 졸업",연도미상,NaN,NaN,NaN,NaN
463,4257.2,2,1,"김일성사범대학 졸업, 불교학원 졸업",연도미상,NaN,NaN,NaN,NaN
874,5659.1,2,1,"삼석인민학교, 평양제4인민학교",1953 ~ 1954,1953,NaN,NaN,NaN
875,5659.2,2,1,"삼석인민학교, 평양제4인민학교",1953 ~ 1954,1953,NaN,NaN,NaN
880,5854.1,2,1,"연도미상 인민군 입대, 공군 비행사",NaN,NaN,NaN,NaN,NaN
881,5854.2,2,1,"연도미상 인민군 입대, 공군 비행사",NaN,NaN,NaN,NaN,NaN

# export multiple career strings

In [36]:
t.to_excel(path_job_str+fileout_job_str,index=False,encoding="utf-8")